{
  "return_dict": true,
  "output_hidden_states": false,
  "output_attentions": false,
  "torchscript": false,
  "torch_dtype": null,
  "use_bfloat16": false,
  "tf_legacy_loss": false,
  "pruned_heads": {},
  "tie_word_embeddings": true,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "architectures": null,
  "finetuning_task": null,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": 1,
  "pad_token_id": 0,
  "eos_token_id": 2,
  "sep_token_id": null,
  "decoder_start_token_id": null,
  "task_specific_params": null,
  "problem_type": null,
  "_name_or_path": "",
  "transformers_version": "4.55.3",
  "num_feat_extract_layers": 5,
  "model_type": "hubert_ecg",
  "hidden_size": 960,
  "feat_extract_norm": "group",
  "feat_extract_activation": "gelu",
  "conv_dim": [
    512,
    512,
    512,
    512,
    512
  ],
  "conv_stride": [
    4,
    2,
    2,
    2,
    2
  ],
  "conv_kernel": [
    10,
    3,
    3,
    2,
    2
  ],
  "conv_bias": false,
  "num_conv_pos_embeddings": 128,
  "num_conv_pos_embedding_groups": 16,
  "num_hidden_layers": 16,
  "intermediate_size": 3840,
  "hidden_act": "gelu",
  "num_attention_heads": 12,
  "hidden_dropout": 0.1,
  "attention_dropout": 0.1,
  "activation_dropout": 0.1,
  "feat_proj_layer_norm": true,
  "feat_proj_dropout": 0.0,
  "final_dropout": 0.1,
  "layerdrop": 0.0,
  "layer_norm_eps": 1e-05,
  "initializer_range": 0.02,
  "vocab_size": 32,
  "do_stable_layer_norm": false,
  "use_weighted_layer_sum": false,
  "classifier_proj_size": 512,
  "apply_spec_augment": true,
  "mask_time_prob": 0.33,
  "mask_time_length": 1,
  "mask_time_min_masks": 2,
  "mask_feature_prob": 0.0,
  "mask_feature_length": 10,
  "mask_feature_min_masks": 0,
  "ctc_loss_reduction": "sum",
  "ctc_zero_infinity": false,
  "ensemble_length": 1,
  "vocab_sizes": [
    1000
  ]
}